# Урок 8. Python применение статистических критериев на практике - пайплайн оценки A/B

In [1]:
import numpy as np
import pandas as pd

import scipy.stats as stats
import statsmodels.stats as sm

import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings('ignore')

## Задание 1

Оцените результаты эксперимента:
* Стат значимо ли отличается ARPU в двух группах?
* Какие рекомендации дадите менеджеру?

In [2]:
df = pd.read_csv('ab_stats.csv')
df

       revenue  num_purchases  purchase ab_group  av_site visit
0          0.0              0         0        A       9.040174
1          0.0              0         0        A       4.811628
2          0.0              0         0        A       7.342623
3          0.0              0         0        A       7.744581
4          0.0              0         0        A      10.511814
...        ...            ...       ...      ...            ...
23647      0.0              0         0        B      10.207152
23648      0.0              0         0        B       5.148761
23649      0.0              0         0        B       4.809019
23650      0.0              0         0        B       8.127488
23651      0.0              0         0        B       8.928102

[23652 rows x 5 columns]

revenue - выручка \
num_purchases - кол-во покупок \
purchase - факт покупки \
ab_group - A/B группы \
av_site visit - кол-во визитов в среднем на пользователя

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23652 entries, 0 to 23651
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   revenue        23652 non-null  float64
 1   num_purchases  23652 non-null  int64
 2   purchase       23652 non-null  int64
 3   ab_group       23652 non-null  object
 4   av_site visit  23652 non-null  float64
dtypes: float64(2), int64(2), object(1)
memory usage: 924.0+ KB

In [4]:
#df.duplicated().sum()

In [5]:
#df = df.drop_duplicates().reset_index(drop=True)
#df

In [6]:
df.describe()

            revenue  num_purchases      purchase  av_site visit
count  23652.000000   23652.000000  23652.000000   23652.000000
mean       0.324689       0.043590      0.020717       7.013112
std        9.557730       1.079403      0.142438       3.154584
min        0.000000       0.000000      0.000000     -12.073486
25%        0.000000       0.000000      0.000000       5.173787
50%        0.000000       0.000000      0.000000       7.007936
75%        0.000000       0.000000      0.000000       8.864119
max     1303.609284     152.000000      1.000000      22.446822

In [7]:
df.isna().sum()

revenue          0
num_purchases    0
purchase         0
ab_group         0
av_site visit    0
dtype: int64

In [8]:
df['ab_group'].value_counts()

A    11835
B    11817
Name: ab_group, dtype: int64

In [9]:
df[df['revenue']>0]

         revenue  num_purchases  purchase ab_group  av_site visit
45      1.885595              1         1        A       7.654627
54      1.002159              1         1        A       6.392489
82      2.990000              1         1        A       8.596604
104    49.990000              1         1        A       8.885633
110    22.093757              4         1        A       8.708759
...          ...            ...       ...      ...            ...
23426   2.489611              1         1        B       9.015714
23493  74.950000              5         1        B       5.881950
23495   3.667866              1         1        B       7.450014
23584  19.990000              1         1        B       9.813696
23616   2.453401              1         1        B      11.909353

[490 rows x 5 columns]

In [10]:
df[df['ab_group']=='A'].describe()

            revenue  num_purchases      purchase  av_site visit
count  11835.000000   11835.000000  11835.000000   11835.000000
mean       0.404462       0.050697      0.021631       6.974724
std       13.133218       1.467511      0.145481       2.023533
min        0.000000       0.000000      0.000000     -12.073486
25%        0.000000       0.000000      0.000000       5.656155
50%        0.000000       0.000000      0.000000       6.982329
75%        0.000000       0.000000      0.000000       8.345572
max     1303.609284     152.000000      1.000000      17.728836

In [11]:
df[df['ab_group']=='B'].describe()

            revenue  num_purchases      purchase  av_site visit
count  11817.000000   11817.000000  11817.000000   11817.000000
mean       0.244794       0.036473      0.019802       7.051559
std        3.176534       0.418480      0.139325       3.976799
min        0.000000       0.000000      0.000000      -8.286822
25%        0.000000       0.000000      0.000000       4.380984
50%        0.000000       0.000000      0.000000       7.060873
75%        0.000000       0.000000      0.000000       9.768648
max      113.830000      25.000000      1.000000      22.446822